app/views/teams/show.html.erb

SELECT `users`.* FROM `users` WHERE (team_id IS NULL) LIMIT 1
---
  <label class="styled-label"> Unassigned Users:
    <%= f.select :user, @nonmembers.map {|t| [t.full_name,t.id] }, {}, :class => "styled-input" %>