app/controllers/teams_controller.rb

  def index
    @teams = Team.all
---
SELECT `teams`.* FROM `teams`

  def show
    @team = Team.find(params[:id])
    @members = User.where("team_id = ?", @team.id)
---
SELECT `teams`.* FROM `teams` WHERE `teams`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE (team_id IS NULL) LIMIT 1

  def edit
    @team = Team.find(params[:id])
---
SELECT `teams`.* FROM `teams` WHERE `teams`.`id` = 2 LIMIT 1

  def create
    @team = Team.new(params[:team])

    respond_to do |format|
      if @team.save
---
INSERT INTO `teams` (`created_at`, `name`, `updated_at`) VALUES ('2014-07-10 00:50:15', NULL, '2014-07-10 00:50:15')

  def update
    @team = Team.find(params[:id])

    respond_to do |format|
      if @team.update_attributes(params[:team])
---
SELECT `teams`.* FROM `teams` WHERE `teams`.`id` = 2 LIMIT 1
UPDATE `teams` SET `name` = 'teamA', `updated_at` = '2014-07-10 01:46:51' WHERE `teams`.`id` = 2

  def destroy
    @team = Team.find(params[:id])
  #Remove all team members prior to delete
    @members = User.where("team_id = ?", @team.id)
    @members.each do |member|
      member.team_id = nil
      member.save
    end
    @team.destroy
---
SELECT `teams`.* FROM `teams` WHERE `teams`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
DELETE FROM `teams` WHERE `teams`.`id` = 1