app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def status
    @user = User.find(params[:id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `teams`.* FROM `teams`
---
  def edit
    @user = User.find(params[:id])
    @teams = Team.all

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `first_name` = 'Ted', `web_site` = '', `updated_at` = '2014-07-10 02:15:32' WHERE `users`.`id` = 1
---
  def update
    user = User.find(params[:id])
    user.update_attributes(params[:user])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
UPDATE `users` SET `team_id` = NULL, `updated_at` = '2014-07-11 08:45:36' WHERE `users`.`id` = 1
---
  def leave_team
    user = User.find(params[:id])
    user.team_id = nil
    user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
UPDATE `users` SET `team_id` = 2, `updated_at` = '2014-07-12 01:32:01' WHERE `users`.`id` = 1
---
  def join_team
    user = User.find(params[:id])
    teamid = Rails.application.routes.recognize_path(request.referer)
    #puts teamid[:id]
    user.team_id = teamid[:id]
    user.save